{
  "title": "How To Get Your Rent Deposit Back When Moving",
  "summary": "Before you move anything into the property, walk around and take pictures of everything. The landlord might have already provided you with pictures, but it’s always worth taking your own. If there is any damage, you should report this to the landlord immediately. This is all about creating a record of the state of the property.",
  "thumbnail": "/images/uploads/how-to-get-your-rent-deposit-back-when-moving-6ruzuucijd5jraldjrwxafm2kk97hn4l42evu544802.jpg",
  "category": "Lifestyle",
  "body": "## How To Get Your Rent Deposit Back\n\nWhen you rent a property, you will have to pay a deposit to protect the landlord against damages. Unfortunately, getting it back when you move out can sometimes lead to a dispute with your landlord. If they’re not happy with the state of the property, they can take some of the deposit to cover the costs. In this article, we’ve explained how to get your rent deposit back when moving.\n\n\n\n![How To Get Your Rent Deposit Back](/images/uploads/how-to-get-your-rent-deposit-back-when-moving-6ruzuucijd5jraldjrwxafm2kk97hn4l42evu544802.jpg \"How To Get Your Rent Deposit Back\")\n\n![man counting money](https://www.gearhungry.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif)\n\n### **When You’re Living There**\n\n### **Take Photos Of The Property**\n\nBefore you move anything into the property, walk around and take pictures of everything. The landlord might have already provided you with pictures, but it’s always worth taking your own. If there is any damage, you should report this to the landlord immediately. This is all about creating a record of the state of the property.\n\n### **Don’t Nail Stuff To The Walls**\n\nIt’s important to make your house a home, but remember it’s not your house. One day, you’re going to move out and rip all of your pictures, posters, and other hangings off the wall. Don’t worry, there is still a way to decorate without damaging the paint. You can buy picture hanging strips that just pull off when you’re ready to remove it. That means no damage and no money off your deposit.\n\n![paintings on the wall](https://www.gearhungry.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif)\n\n### **Keep It Clean And Tidy**\n\nWe don’t want to sound like your parents here but keep your house clean and tidy. Mess and dirt in the house can lead to more serious damage and even attract pests and rodents. Not only is this a huge warning sign to your landlord, but it also means you will have a harder time cleaning the property when you’re ready to leave. You don’t have to clean the cupboard doors every day, but giving it a once over every week is important to keep it in good condition.\n\n### **Keep A Record Of Any Damages**\n\nEven if you’re the perfect tenant, you might still damage the property in some way. Whether you create a scuff on the wall, scratch the floor, or anything else, it’s worth keeping a record of the damage and let your landlord know immediately. This lets your landlord know that you’re not trying to hide anything and you’re taking the upkeep of the property seriously.\n\n![home](https://www.gearhungry.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif)\n\n### **Stick To The Terms Of The Tenancy Agreement**\n\nWhen you rent a house, you will have to sign a tenancy agreement. Inside this document, there will be a section on the deposit. This might have some stipulations – like[cleaning the carpet](https://www.gearhungry.com/carpet-cleaning-tips/)or cleaning the windows – that you have to follow to get your full deposit back. This isn’t the case with every rental property, but it’s worth looking out for.\n\n### **Maintain A Good Relationship With Your Landlord**\n\nUltimately, the amount of deposit you get back is up to the landlord. You can challenge them on it if you don’t agree, but it’s always easier if you don’t have to. This isn’t a tip for guaranteed success, but if your landlord likes you, they’re more likely to let you off easy. Be polite and respectful with them, keep the property in good condition, and even send them a thank you card when you move out.\n\n![landlord and tenants](https://www.gearhungry.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif)\n\n### **Before You Leave The Property**\n\n### **Give The Property A Deep Clean**\n\nWhen your landlord walks into their property after you’ve moved out, they’re looking for any damage. If the house is super clean, there’s nothing left behind, and there are no strange smells in there, they will relax as soon as they walk in. Deep-cleaning your property is one of the most important steps to getting your deposit back.\n\n### **Take Photos Before You Leave**\n\nWhen you leave the property and you’ve moved all of your furniture and stuff out, take another set of pictures. This is to protect you from being charged for any damage caused after you’ve left. This is rare, but some landlords will try and get every bit of money they can.\n\n![lease agreement](https://www.gearhungry.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif)\n\n### **Ask The Landlord To Sign A Check-Out Inventory**\n\nYou can create an inventory after you’ve left and ask your landlord to sign it. If they’re happy with the inventory, they should have no problem signing it.\n\n### **What Your Landlord Should Take Money For**\n\n* Scuffs and marks on the wall – If they were caused by you, the landlord is within their rights to pay for repairs that wall, whether that means repainting or just touching up.\n* Any outstanding rent – If you haven’t finished paying rent, the landlord can deduct this from your deposit.\n* Any damage to the property that doesn’t include wear and tear – If you’ve damaged any of the white goods or anything else in the property, the landlord will take this out of your deposit.\n* Lost items from inventory – When you move in, there should be an inventory that lists everything included with the property.\n* Cleaning costs – This is probably the most common thing deducted from deposits. Even if you’ve deep-cleaned, they might still try to take some.\n\n### ![keys to the house](https://www.gearhungry.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif)\n\n### **How To Dispute Your Deposit Deductions**\n\nRemember that the deposit money is your money. If the landlord wants to take any money from it, they need to provide proof. If you don’t agree with something on the deductions, here are the steps you should take to.\n\n### **Talk To Your Landlord**\n\nIf your landlord is reasonable, you might be able to avoid a formal dispute by telling them. If you are disputing something on the deductions, you should provide any proof you have. The more information you can provide, the more likely they are to agree with you.\n\n![boxes for moving](https://www.gearhungry.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif)\n\n### **Check The Tenancy Agreement**\n\nDepending on where you live, there might be a governing body that can settle the dispute for you. For example, in the UK, your deposit should be protected by the Tenancy Deposit Scheme. This is the last step before legal action.\n\n### **Legal Action**\n\nThe last resort is to take your landlord to court. If you are considering this option, it’s really important to work out how much it’s going to cost, because you could end up even more out of pocket.",
  "date": "Sunday February 16th, 2020",
  "update": "2020-02-16T21:43:13.303Z",
  "author": "JORDAN CARTER"
}