{
  "body": "Chapter 1 : <!--StartFragment-->\n\nHow to start a career as a GOSPEL ARTIST/MUSIC MINISTER!!\n\n<!--StartFragment-->\n\nThis week I’m led in my spirit to share with my friends a few tips on starting up a career as a Gospel Artist! I didn’t know most of these things and that caused me a lot! Since I had to learn while on the job I made mistakes you shouldn’t make, so if you are thinking of starting up a career as a Gospel Artist please read this series! Thank you ![🙏🏾](https://static.xx.fbcdn.net/images/emoji.php/v9/t7e/1/16/1f64f_1f3fe.png)\n\nBefore we get into serious things let’s start with the basics.\n\nWHY DO YOU WANT TO DO GOSPEL MUSIC?\n\nUsually, when I ask this question I get all kinds of responses but I still insist that the motive is different for every individual! Away from the “common denominator” which is Winning souls and reaching out to people, there is always a motive and you should be conscious of it!\n\n Do you think you are Called? Who called you, is it God, your pastor, your church, or some situation that made you realize you were called for this? What is pushing you to do Gospel music? Your motive is more important than your talent and anointing! I’m not your moral compass so I can’t be telling you which motive right or wrong but I trust that you know already! \n\nFIND AND ANSWER TO THIS QUESTION AND WRITE IT IN YOUR HEART. IF POSSIBLE MAKE A BIG POSTER OF IT AND PLACE it IN YOUR BEDROOM SUCH THAT IT IS THE FIRST THING YOU SEE EVERY MORNING! \n\nBecause the journey you are about to start is more complicated than it looks and if you are not CERTAIN of the voice you heard and the assignment you have been sent to accomplish then the world will show you another part! Let this be the Birthplace of your MUSIC MINISTRY.. SO WHY GOSPEL MUSIC![🤷🏾‍♂️](https://static.xx.fbcdn.net/images/emoji.php/v9/ta3/1/16/1f937_1f3fe_200d_2642.png)\n\nWHAT IS YOUR MESSAGE? WHAT ARE YOU PREACHING THROUGH YOUR MUSIC?\n\nA song could be many things but for the sake of this TALK, I’ll like you to consider every song you sing as a sermon and your listener as your congregation! I know we all are called to preach Jesus as commanded in the great commission but WHERE ARE YOU PREACHING JUSUS FROM? What seed do you intend to plant in your listener?\n\n What is the unique content of your “sermon” that will push somebody to listen to your message over and over! This is beyond poetry and rhyme schemes, it is definitely not about eloquence and having the right Phonetics and pronunciations. All these things are good but trust me feeding a Man’s soul Goes way beyond that! You have to preach JESUS in your own way, in the way that you best \n\nUNDERSTAND HIM! Jesus could be a Mighty healer for me but Is a Great comforter to you! So don’t copy my message because we ain’t preaching from the same place! \n\nYes, we are talking about the same JESUS but he’s revealed himself differently to us all so you have to search from deep within Who Jesus is to you and “PREACH” Him in the way you understand him if not you will join the many who are in the game of putting suitable words together to make their music sound nice! \n\nYou can’t minister IN THE SPIRIT FROM THE FLESH! You can’t talk about a JESUS you have not encountered or in a way you haven’t encountered Him and you expect to sound as convincing as you just sharing your own Testimony! One man’s journey could lead HIM to “banga Bush” while another could lead to a classroom somewhere! My Cameroonian friends would best understand that.\n\nChapter 2: <!--StartFragment-->\n\nHOW TO START A CAREER AS A GOSPEL ARTIST/MUSIC MINISTER (part 2)\n\nSo in my last write-up, I spoke about the basic questions you need to answer before you venture into Gospel Music as a career! And I said you need to be certain as to WHY you want to do Gospel music and what message you would be passing as a Gospel Artist! Also for the sake of clarity, it is important that we note that there is a big difference between a church singer/choir member and a Gospel Artist and as this series goes on we will be throwing more light on that! Today I want us to about your AUDIENCE!\n\nWHO IS YOUR AUDIENCE?\n\nHave you ever seen someone profess love for a certain song or a particular artist and wonder why?? \n\nBecause to you what that person is singing is a total mess and you’d never listen to it even if you were paid to! Well let’s look at it this way, Music they say is food for the soul and while other people like myself appreciate different varieties others might be drawn to just one or just a few! \n\nSo as an artist picture yourself as a chef who is trying to make a meal. WHO ARE YOU COOKING FOR OR RATHER WHO DO YOU THINK CAN EAT WHAT YOU COOK? Your audience shouldn’t determine the kind of music you do rather the kind of music you do should determine the kind of people who listen! Just a few things that you should consider while determining the kind of people to target!\n\n**YOUR GENRE**\n\nHonestly, if you are reading this post as an aspiring Gospel artist and you don’t know what a Musical Genre is then maybe this series isn’t for you! I’m not trying to teach music here oh rather I’m trying to share with people who already have some musical skills and knowledge how to make a living out of that. So if you need music lessons please get a music school.\n\nMeanwhile, the genre of music you choose to do will greatly influence who listens to you and so you need to be very intentional about that. \n\nOne of the greatest advantages of learning music in the church which I assume is where most of the people who are reading this learned from is the fact that in church we are groomed to learn, play, and sing everything. \n\nUnlike people who learn music from other places the church actually grooms us to be all-around musicians whether you like it or not. That blessing could be a source of confusion if you don’t define who you are at the very beginning. \n\nBecause you can do everything doesn’t mean you should do everything. It is very advisable to find your lane(s) and stick to it. For example, the Best Gospel bikutsi Artist I have ever known is MAMA MARRY MANDY, \n\nThe best Hip-hop/Rap artist I know is G4, The best Gospel Reggae Artist I know is BUCHI, The most profound congregational Worshiper I have ever seen live is ROCHIE OSVALIN, The best musical storyteller is MAMA ELIZABETH TEKEH and it’s important to note that most of her songs have the same bits and almost the same musical progression and we don’t mind. \n\nThe most Creative and insightful worshiper I know is Flavy praise, the best Afro/jazz Gospel artist is Ronel Valerie, the man that can make you dance Makosa while thinking of God's Goodness is Charles Citenga meanwhile the most vocally upright Afro/Makosa singer is Guy Michael. The list is long and I only used these names for sake of clarity and understanding, please no one should argue about my ratings because I know you people.\n\nSo as I suggested above you need to be known for something and I’m talking mostly about studio/ Live recordings. When it comes to gigs we all can play around but everyone knows their league so find yours and stay there.\n\nYes, from time to time you find Artists juggling around a couple of Different genres but most of them can’t be too far from each other! I hope you understand.\n\n**YOUR MESSAGE!**\n\nSo let’s say your genre is the CONTAINER then your message is the content! The lyrical content of your song(s) would greatly influence the kind of people who listen to it and by “Kind of people” I mean different age groups, people who speak different languages, people from different denominations(which is a very big challenge) people from different cultures, people who practice a different doctrine from yours or who believe in different things, for example, I have spoken in tongues in all my songs released so far and so if someone doesn’t agree with the doctrine of speaking in tongues then.\n\n We live in a world of diversity and so you can’t please everyone just as you can’t be pleased by everyone. It is important for you to carefully choose the part you take in content creation from the beginning because changing that along the line will be more difficult! So if you choose to sing HOLY GHOST FIRE please sing just that till you retire or you grow to pass that level Knowledge, if you are singing rapture sing rapture in all your songs and make sure not to change to “Grace” or “New Creation”. \n\nIf you choose to talk about Faith and hope for the future please stick to it, if you choose to sing about the “Holy Spirit” please do it in the best way possible. When an artist is intentional about the content He creates all of His songs sound like one long sermon saying the same thing over and over with mostly the same Genre and that is More of strength than you think it is.\n\n Bob Marly has thousands of reggae songs and all of them are talking about almost the same thing! Don’t confuse your audience.\n\nSo after reading this post as an aspiring Gospel Artist you should be able to Say my Name is …………….. A Gospel Artist who majors on Bikutsi, ariaria and High life and who’s aim is to spread the Gospel of Jesus by continuously talking about Righteousness and Morality and who’s major target audience should be…………………………….\n\nThough you can never be accurate about all this, it is important that before you start releasing songs you know these things. This will determine a lot in your career like your songwriting, your video concepts, your networks and invitations, your dress patterns etc…\n\nYou can get to the Top by mistake but NOBODY stays on top by mistake. The Impact is consistently making intentional moves towards your goal. \n\nMany people like myself just get carried away by talent and zeal to start releasing songs(which is a good thing) without having the right knowledge! Your Skill is needed, your zeal is very much needed but you need to know these things before taking your songs to the studio if not even the original ideas of your own songs will be changed to suit the inspirations of the producer! In one of the topics, I’ll talk about WHAT YOU SHOULD DO IN YOUR FIRST EVER STUDIO SESSION!\n\n\n\nChapter 3: <!--StartFragment-->\n\nHOW TO START A CAREER AS A GOSPEL ARTIST/MUSIC MINISTER (Part 3)\n\nSo like I said in my first write up I was led to talk about starting a journey into Gospel Music as a career. I think my major drive and motive for doing this is mainly so that those who intend to start doing Gospel music should have a guide and understand that the path they are about to take is not as casual as it seems! I have spoken about some important things in my previous write-ups and if you are just stumbling on this I think you should read the other topics so that this will make more sense. So today I’d talk about something I’ll title BABY STEPS! Which technically is a manual to guide you on your newfound journey.\n\nBABY STEPS!\n\nSo after you’ve prayed and you are certain in your spirit that God has called you into the Ministry of Music and you have the right skill set, how do you begin? This is the point where many people get frustrated and like myself start venting and saying things they shouldn’t be saying because of one thing or another. \n\nNow at this point, you need CAPITAL( Both Finance and Human Resources) because you need to record your songs, shoot your videos, take pictures, build a platform online, start a YOUTUBE CHANNEL and represent yourself the right way. Now, the reality around here is that most of the people at this stage don’t have money, neither do they have any contacts or connections except for a privileged few.\n\nThe Biggest temptation at this stage is to DEPEND ON PEOPLE! Because you will definitely get hurt. Whether it’s your pastor, your family, some elder at your church, or anyone who made one promise or another please don’t depend on them. \n\nI believe in PUTTING YOUR MONEY WHERE YOUR MOUTH IS so if you really believe in your talent and you are certain that you want to do this then you will DIG for that money. \n\nYou will WORK HARD and do whatever it takes to get that money. I swept the studio and did house chores for the person who produced my first album for many months just to make that happen. I can’t begin to talk about the things I did personally and what I’ve read about others but I’m certain that money has never limited any person with a dream. If want to do it God will make a way and your price will be serious. So look for the money!\n\nThe other temptation we all fall into is the quest to work with the BIG NAMES. As a rookie, you need to understand that people don’t actually believe in you the way you believe in yourself so don’t expect a warm welcome into the BIG LEAGUE. You need to walk your way up my friends and the most effective way to that is to work with people who are in almost the same place as you in their own career.\n\nDon’t go for the Biggest music producer, video director, make-up artist, biggest events, etc.\n\n Chances are those guys will mess you up. For those of you who have tried that you can attest to the fact that they don’t take your work as seriously as you do, your song should have been in the studio for more than 6 months and it has not been mixed or mastered yet someone who came after you is already in the market. The reason is you don’t have money, you don’t have a name, they are not even sure people will listen to your music, they most likely don’t even have your time or believe in you. \n\nThis can draw you especially for those who very emotional and for my female friend's chances are people are definitely going to make other demands which I’ll talk about in another topic.\n\nSo for your own good, I’ll advise you to work with people at your level even if you have the money. There is a young producer, videographer, or photographer who is as eager as you are to put their work out there, these are people who are looking for the same visibility as you, they believe that your material could be the platform through which people might get to know them so they’ll treat your work and your career with care. They won’t impose on you or make you feel like you can’t do it rather they will encourage you to push ahead because they have the same goal as you.\n\nThe greatest quest of every content creator is the quest to be heard/seen. Nobody wants to spend many hours creating a song or a video that people wouldn’t want to see. Whether we admit it or not we all wish we had MILLIONS OF VIEWS AND FOLLOWERS.\n\n I want to be worldwide, I want to write songs that are sung around the world, I want my ministry to carry me places but I must understand that God takes HIS TIME to build MEN and give them the CAPACITY to BUILD other MEN! God is not in haste my friends but usually we are, and sometimes we might lose sight of what is important. What I’m trying to say is chances are NOBODY might want to listen to your first song, or the second, or the third…. \n\nOnly God knows the song that will make you “BLOW” that’s why you shouldn’t lose sight of HIM in the quest to BLOW! It could take you 20 years as much as it could take 1 day! The longer the time you spend in the incubator the more resilient and trusts worthy you become. \n\nPersonally, I’m no longer excited about things that used to excite me rather these days I am more intentional about every step I take. At this point, my greatest prayer is to go international and not just to stand on intentional platforms but to create international platforms so that others can stand there. I know I have what it takes but I have chosen GOD’S WAY above SPIRITUAL POLITICS. So if it’s going to take 20 years I’m here preparing myself and thank God for calling me young! Back to the topic ![👇🏾](https://static.xx.fbcdn.net/images/emoji.php/v9/td/1/16/1f447_1f3fe.png)![😂](https://static.xx.fbcdn.net/images/emoji.php/v9/td0/1/16/1f602.png)\n\nThis is your first project and you don’t have an audience yet.. you might think you have because you are a minister at your church and you participated in a few other events but it doesn’t work like that! It takes TIME to build TRUST, it takes TRUST to Build RELATIONSHIP and it takes RELATIONSHIP to build CAPACITY AND RESPECT and it takes CAPACITY AND RESPECT to build a STEADY AND RELIABLE AUDIENCE. \n\nSo don’t get depressed when people don’t treat you as think you deserve to be treated. You are a star “in your mind” not theirs, Especially in Cameroon where we are still trying to build a system that works. There is clearly no reliable marking system here as far as Gospel music is concerned and recent happenings have proved that so don’t kill yourself. Put in your best efforts knowing that you will have to do better. Bear in mind that excellence is built over time so starting from somewhere is never a crime. \n\nDon’t let the pressure of trying to meet up the way you out.\n\n keep doing what are doing until God himself increases you. I trekked daily from Bakwerri town to mile 16 for many months to record my first album that nobody wanted to listen to including YOU. After that, I’ve recorded many songs before recording the line of songs that most of you can listen to.\n\n Your growth has to be visible in everything. As you grow in your career you’d realize that your singing skills will grow, your songwriting will grow and your perception of many things will change. For the sake of this teaching, I’ll attach a link to one of the first songs I ever recorded so that you should be the judge.. start now and grow!\n\nPlease be patient my friends, don’t rush into anything. If You want to do music for the rest of your life you can’t Afford to lose steam this early. This path you have Choosen will show you many colors. You are getting into the spotlight so everything about your life will be amplified, your strengths, your weaknesses, your personal life, and all you do. \n\nThat is why I said you need to make a BIG POSTER of your MOTIVE and place it at a spot in your bedroom such that it is the first thing you see every morning. Many people for some reason think being a Gospel artist is EASY until they get into it and then quit after a few years. In the past few years, we can attest to the fact that we have seen many people start careers and some even launch albums and in less than 2 years they are nowhere to be found. \n\nThat’s why I PERSONALLY DO NOT RESPECT ANYONE WHO HAS NOT BEEN DOING WHAT THEY ARE DOING FOR AT LEAST FIVE YEARS! Starting is actually very easy but continuing is very challenging so before you start please “Count your cost” if not you will quit.\n\nA few years Ago someone who at the time was just a regular singer wrote to me and asked why most of the songs we “Cameroonian Gospel Artists” sing do not go viral like the Nigerians or people from other places. I remember this person said “Y’all should wait for me because when I start I’ll show you how it’s done” lol  well he has put out a couple of songs and I’m watching and learning \n\nThis is just the introduction to the topic BABY STEPS and I hope after reading this you build courage because you will need it. I’m not trying to scare you away but if you get scared then it’s a good thing. We have been CALLED to the service of God’s people that is the most challenging yet fulfilling path ever. \n\nChapter 4: <!--StartFragment-->\n\n**WHAT TO DO DURING YOUR FIRST EVER STUDIO SESSION.**\n\nI want to assume that most of the aspiring artists who are reading this post have never been to the studio but even if you have this could still make a difference. So you’ve booked your session and it’s time to start MAKING THE MUSIC.\n\n\\-The first thing you need to do is to TALK WITH THE PRODUCER and share your ideas with him. Personally, when I conceive a song I turn to have an idea as to how the final product should sound like. I might not be certain of all the instruments but in my spirit, I know what can or cannot go. \n\nEvery song has a place where it’s birthed from and for that inspiration to materialize in its finest capacity there is got to be a bond between the minds and spirits involved. Don’t take this for granted because you didn’t sleep on the same bed with that producer or even if you did you still don’t have the same mind.\n\n Producers make music every day and sometimes they turn to be passive about the fact that Music is very spiritual so you need to remind them. When you manage to synchronize your mind with that of the producer every instrument they use, every plugin and every idea turns out to be what you envisaged.\n\n**\\-You need to have a REFERENCE**\n\nDon’t deceive yourself to think that the music you are about to produce has never been produced before. Whatever you are trying to do someone had done it before so you need to walk in that light. \n\nYou need to walk in the Oder of those who inspire you. Music is not very complicated my friends and no man is an island that is why you need others. There is a very big difference between REFERENCING AND COPYING. \n\nThat song you are about to record now was inspired by somebody or a group of people whether consciously or unconsciously. Yes the HOLY SPIRIT gave you that song but if you check your playlist I bet you’d hear a couple of songs that have a resemblance with what you want to do so when going to the studio it is important that you take those songs and play them for your producer to listen. Music has just 12 basic notes and yet people have been singing and writing songs for as long as the earth has been so there’s nothing too strange you can do now but rather you can use those basic notes and do your own thing in your own way.\n\n\\-You need to be part of the creative process of your song. You wrote that song, you conceived it so no one can understand Feeling like you. This is the reason why MOST GOSPEL SONGS SOUND THE SAME. \n\nThe reason why you might not care is that you have no ideas.. you’ve just put a few words together and you call it a song but when you know what you are doing you build the music while writing the song. Most people just take their music to the studio and dump it in the hands of the producer who produces countless songs every month, the guitarists who come to the studio once in a while play on at least ten songs each time they come and no matter how inspired those people are chances are they play their own thing not yours and before you know it your song is sounding nice to others but strange to you.. \n\nBe part of the making my friends and don’t just come and sing and leave hoping that they will do the magic. THE MAGIC IS IN YOU!\n\n\\-Every song is a spiritual sound code that opens up something in the heart of the listener. Music in itself is one of the strongest things God ever created. \n\nIt is only with music that you can be insulting someone and the person is Dancing. You need to be intentional about everything that is said in your music. Don’t say something you can’t explain or you don’t know just because you heard someone say it. Jesus Christ said THE WORDS THAT I SPEAK UNTO YOU ARE SPIRITS, AND THEY ARE LIFE. when you realize that your music could be the channel through which someone might find Salvation, peace, or healing you wouldn’t trivialize the process of MAKING.\n\nPray like it depends on God and works as it depends on you. Put in your best to see that your song has the best lyrical content and the best musical production you can get at the time. \n\nTo some extent, it is better to share ideas with people of like passion who can help edit your work especially your GRAMMAR. Don’t sing something that only reminds people of a dictionary so be open for edits. I’m saying this because there are some OVER SPIRITUAL BRETHREN who can’t take simple grammatical corrections in the name of\n\n “that is how the Holyspirit gave me” and at the end of the day you find yourself explaining your lyrics to people.. THE MOST DIFFICULT SONGS TO WRITE ARE USUALLY THE easiest SONGS TO SING. Simplicity is not a weakness my friends. I know you are Born of the spirit, filled with the Holy Ghost and profound in knowledge but let that reflect in the power that accompanies your simple words and not in the complexity of your empty words… \n\nKEEP YOUR LYRICS SIMPLE!!\n\n\n\nChapter 5 : <!--StartFragment-->\n\n**THE ROLE OF YOUR PASTORS/SPIRITUAL AUTHORITY AND YOUR LOCAL CHURCH IN YOUR CAREER AS A GOSPEL ARTIS**T.\n\nThis is the point where many people get frustrated because of too much entitlement and denying to accept our reality. It is important to note that I’m particularly talking to Cameroonians and for the sake of better understanding from time to time I might sight a few examples. I have heard many Gospel artists complain about not being supported by their pastors/church and according to them, that is the reason why they are not making adequate progress. Today I want us to solve that problem by being real.\n\n\\-YOUR PASTOR IS NOT YOUR SPONSOR.\n\nMany people get hurt because of what I call the demon of entitlement and this has negatively affected our Christian music community. Your pastor has one responsibility for your life and which is teaching you the word of God and growing you spiritually and it ends there. Any other act of love and support is FREE WILL and so you shouldn’t feel entitled. You must understand that just like every other member of the church who has a career may be in something else like medicine, law, sports etc, your career is your PERSONAL BUSINESS.\n\nYou hardly hear doctors in church complaining of not being supported or athletes saying that the pastor doesn’t care about them. why must it always be musicians, why must we always complain?. I think it’s because we do not know that our service is unto God and not unto the pastor, I think it is because we have not understood that as God has placed us as pillars to support the ministry of our pastor so will He send others to support us.\n\nI can’t deny that most people have abusive tendencies which I will handle as an independent topic but when you understand that the supplies you need to advance your career can only come from God you will focus your mind on God and not the man of God.\n\nYES I know you have seen on TV or heard how a certain artist is hyping His/Her Man of God and you think yours is just wicked. \n\nWhen you understand the reality you will know that what you heard is what they wanted you to hear and that is not the complete story. Your pastor’s job is to teach you the Bible, teach you how to minister, give you a platform to the best of His capacity as he is led by the spirit, mentor, and coach you in the direction of your own ministry and not to SPONSOR YOUR CAREER. I know we always take examples from the Nigerians and talk about how their pastors support their artists and all that But our reality is different my friends and it’s high time we accepted that..\n\n\\-This is our reality.\n\nThere is no REDEMPTION CAMP in Cameroon, there is no COZA in Cameroon, There is no PLATFORM IN CAMEROON THAT YOU ARE CERTAIN TO “BLOW” AFTER MINISTERING THERE, There is no EAZEE CONCEPTS in Cameroon, there is no PASTOR CHRIS in Cameroon.\n\nPentecostal churches in Cameroon with a thousand steady members are not up to a hundred, we clearly don’t have the same narrative as the Nigerians so it’s high time we stopped measuring ourselves with people who are decades ahead of us.\n\nWhat I’m trying to say is as much as you are trying to start your career now I am certain that your Pastor is also at the early stages of His Ministry. Your local church is still trying to have its own land or church building and you think recording songs for you would be your pastor's priority? We tell these stories out of context sometimes and it’s sickening so wake up and FIGHT FOR YOUR DESTINY.\n\nOur reality is that there is no system that permits that older generation to hand over or at least lift up the younger generation. Today we celebrate the rising of countless music ministers from Nigeria but I can bet that if you look at it critically you will trace what is happening today to the founding fathers of Gospel Music in Nigeria like the VOICE OF THE CROSS and the people before them. You can see how it developed musically and spiritually through different dispensations and different front-liners from the likes of Alice and Paul(akanchawa), Agatha Moses, Destined kids, Jump and Pass, Chioma Jesus who is still active, Pastor Panam, and then Pastor Nathaniel Bassey, Sinach, Frank Edwards etc. you can trace that till you meet the guys who are coming out now and those who will come out tomorrow!\n\nBut our reality is different.\n\nWe are still at the early stages of Digging the foundation of our “industry” so stop Comparing and start working. Yes, we have had Gospel artists who made a nationwide impact with their music but for some reason, it ended with them.\n\nBecause I’m trying to avoid controversy I will not mention why in this post but if you are getting into Gospel Music now with the ideology that you will sing Just one hit song and your life will change please think again. Consider yourself a FOUNDING FATHER and get your digging tools and start digging as we all lay the foundation on which others will excel tomorrow. The is no other way, my friends. We have a lot of groundbreakings to do, we need to earn the trust of our people and make them love and consume what we have and one hit song will not change that.\n\nSo don’t blame your pastor for not giving you money because his reality might be that he doesn’t have. Don’t blame your local church choir for not singing your songs because your reality is that they still don’t believe in you, don’t blame your congregation for not supporting you because they are doing their best to support the church to grow. I said this same thing 5 years ago and I almost got killed on this same Facebook but I will dare to say it again. FOR YOU TO ADVANCE AS A GOSPEL ARTIST YOU MUST LEARN TO TAKE YOUR MUSIC OUT OF YOUR LOCAL CHURCH. Don’t see your church as a platform to shine rather see it as your training ground where you get fed and empowered to CREAT YOUR OWN PLATFORM.\n\nSee your music ministry as a separate and independent ministry such that just like the pastor and church organize crusades, go out for evangelism to win souls to grow the church you will also learn to figure out how to spread your music beyond the church. This is the reason why many people leave where they have been divinely positioned to serve, learn and grow to the place where “Things happen”. Only God can lift a man or rather God is only responsible to Preserve those he lifts. All these Gimmicks and Spiritual politics, changing spiritual father, changing church, or Going to a church with more population is a sign that you haven’t met God. When God opens your eyes to see our reality and the work we have to do you settle down and get to work. Maybe your growth as a music minister is what would contribute to the expansion of your local church?\n\nI made up my mind long ago to take my music out of my local church yet that doesn’t stop me from serving there, that doesn’t stop me from fellowshipping there, that doesn’t stop me from the feeding of the word of God from my man of God and most importantly that doesn’t make me disloyal rather it makes me have a sense of responsibility and not of entitlement. One day in our church I saw a long line of musicians and other church workers who were waiting to collect transport after service, I was worried in my spirit and I intentionally decided not to add to the burden of my pastor.\n\nMusic Is my gift and through that,  I can be a blessing to my congregation and the entire body of Christ and if I am really good at it then it would make a way for me. So I’m not entitled to any form of support if my pastor lets’s minister in church fine if not I’ll minister on my own platform, if he lets me use our church building to organize a concert fine, if not I’ll rent a venue. If my church brethren listen to my songs great but if they don’t others will. When the Holy Ghost breeds into a song it breaks across all barriers and that’s my focus, not my pastor or my church.\n\nSo my dear aspiring Gospel artist who is by default is also a FOUNDING FATHER please note that the road you about to take is not an easy one or the might not be any road at all or the people digging that road have not gone very far so you have been called into the ministry of Digging.\n\nAs you join the others who are currently digging the foundation for what would come please understand that God has other people who have other digging methods that might be contrary to yours. You need to be flexible enough to let them dig their own path as you are digging yours. Don’t be like those who were before you who despite their lifting was not able to lift up others because they didn’t like one thing or other about them.\n\nPlease note that this road you are digging now is not for you, that this breakthrough you are praying for might not happen in your time, or if Jesus tarries it might happen in your old age. So don’t block others from passing to go ahead and continue digging because you feel insecure, when you dig and discover anything precious please do well to share with those around you and not be selfish. As you are trying to hold the hand of others now please also be ready to lend a helping hand to others when they need it even if you are not from the same Congregation or share the same ideologies. As you dig and go forward please know that it will not get any easier because the bigger your platform the greater your responsibility.\n\nThe story that will be told about Gospel Musicians from Cameroon will definitely be different so shape your dreams and visions according to your reality or rather don’t dream that things would happen to you as it happened with others. Last year I attended a live recording concert and I saw someone who was invited to minister as a guest artist from far came on stage and mimicked a certain Nigerian song from start to finish and I laughed.\n\nThat comes to show that we have a very long road and even if we have to copy from the Nigerians we should copy their spirit of what I call “Cultic Patriotism” because a Nigerian minister will Never sing your song except you are big in your area and he is trying to get your audience talk less of singing it during a live recording. Even if they like the song too much they will change it and sing it in their own way so that is exactly what we should be copying.\n\n<!--EndFragment-->\n\n<!--EndFragment-->\n\n<!--EndFragment-->\n\n<!--EndFragment-->\n\n<!--EndFragment-->",
  "summary": "This week I’m led in my spirit to share with my friends a few tips on starting up a career as a Gospel Artist! I didn’t know most of these things and that caused me a lot! Since I had to learn while on the job I made mistakes you shouldn’t make, so if you are thinking of starting up a career as a Gospel Artist please read this series! Thank you!",
  "update": "2021-05-09T20:39:06.449Z",
  "position": 1,
  "author": "dIyA2l79NifO81mlNIh6t",
  "slug": "for those who have chosen the gospel music path, this is for you. ",
  "thumbnail": "https://res.cloudinary.com/dyt6izhug/image/upload/v1620595688/etta_utqkmy.jpg",
  "seo_keywords": "Min Etta's Masterclass - Starting A Gospel music Career ; Chapter 1,2,3,4,5 ",
  "featured": false,
  "date": "Sunday May 9th, 2021",
  "seo_title": "Min Etta's Masterclass - Starting A Gospel music Career ; Chapter 1,2,3,4,5 ",
  "title": "Min Etta's Masterclass - Starting A Gospel music Career ; Chapter 1,2,3,4,5 ",
  "seo_description": "This week I’m led in my spirit to share with my friends a few tips on starting up a career as a Gospel Artist! I didn’t know most of these things and that caused me a lot! Since I had to learn while on the job I made mistakes you shouldn’t make, so if you are thinking of starting up a career as a Gospel Artist please read this series! Thank you!",
  "id": "L1tKuFqOn2YpSjZ5tC6ZS",
  "category": "-rIDN-OdYTl_JzhoN4FaX"
}